
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("Модифицированость", Модифицированность());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ДополнительныеСвойства.Модифицированость Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолкиСтеллажей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПолкиСтеллажей КАК ПолкиСтеллажей
		|ГДЕ
		|	ПолкиСтеллажей.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПолкаЭлемент = Выборка.Ссылка.ПолучитьОбъект();
		ПолкаЭлемент.Удалить();
	КонецЦикла;
	
	Для Секция = 1 По КоличествоСекции Цикл
		
		Для Полка = 1 По КоичествоПолок Цикл	
			ПолкаЭлемент = Справочники.ПолкиСтеллажей.СоздатьЭлемент();
			ПолкаЭлемент.Владелец = Ссылка;
			ПолкаЭлемент.Наименование = СтрШаблон("%1 - %2", Секция, Полка);
			ПолкаЭлемент.Записать();	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти