
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьСхемуСтеллажа(ТекущийОбъект);
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьСхемуСтеллажа(ТекущийОбъект);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСхемуСтеллажа(ОбъектСтеллажа)

	СхемаСтеллажа.Очистить();
	Стеллаж = РеквизитФормыВЗначение("Объект");
	МакетСтеллажа = Стеллаж.ПолучитьМакет("СхемаСтеллажа");
	ОбластьПолка = МакетСтеллажа.ПолучитьОбласть("ОбластьПолка");
	ОбластьРазделитель = МакетСтеллажа.ПолучитьОбласть("ОбластьРазделитель");
	
	Для Секция = 1 По ОбъектСтеллажа.КоличествоСекции Цикл
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Вывести(ОбластьРазделитель);	
		
		Для Полка = 1 По ОбъектСтеллажа.КоичествоПолок Цикл
			ОбластьПолка.Параметры.АдресЯчейки = СтрШаблон("%1 - %2", Секция, Полка);
			ТабДок.Вывести(ОбластьПолка);
			ТабДок.Вывести(ОбластьРазделитель);
		КонецЦикла;
		
		СхемаСтеллажа.Присоединить(ТабДок);
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

